In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('../../datasets/salaries.csv')
df.head(5)

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
df_new = df.drop(['salary_more_then_100k'], axis=1)
df_new.head(5)

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

#### We have character data in given input which we need to convert to interger

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [6]:
df['company_new'] = le_company.fit_transform(df['company'])
df['job_new'] = le_company.fit_transform(df['job'])
df['degree_new'] = le_company.fit_transform(df['degree'])
df.head(5)

,company,job,degree,salary_more_then_100k,company_new,job_new,degree_new
0,google,sales executive,bachelors,0,2,2,0
1,google,sales executive,masters,0,2,2,1
2,google,business manager,bachelors,1,2,0,0
3,google,business manager,masters,1,2,0,1
4,google,computer programmer,bachelors,0,2,1,0

In [7]:
input = df.drop(['company', 'job', 'degree', 'salary_more_then_100k'], axis=1)
input.head(5)

   company_new  job_new  degree_new
0            2        2           0
1            2        2           1
2            2        0           0
3            2        0           1
4            2        1           0

In [8]:
target = df['salary_more_then_100k']
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [9]:
from sklearn import tree

In [10]:
model = tree.DecisionTreeClassifier()

In [11]:
model.fit(input, target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

#### Here we can tune criterion, impurity

In [14]:
model.score(input,target)

1.0

## Exercise

In [88]:
df = pd.read_csv('../../datasets/titanic_train.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [60]:
input = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1)
input.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [61]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

#### Seems like we have Nan values in data and either we can drop those and replace them with mean

#### Try drop na values and check

In [62]:
input = input.dropna()

In [63]:
input['Sex_new'] = le_sex.fit_transform(input['Sex'])
input.head(5)

   Survived  Pclass     Sex   Age     Fare  Sex_new
0         0       3    male  22.0   7.2500        1
1         1       1  female  38.0  71.2833        0
2         1       3  female  26.0   7.9250        0
3         1       1  female  35.0  53.1000        0
4         0       3    male  35.0   8.0500        1

In [64]:
target = input['Survived']
input = input.drop(['Sex','Survived'], axis=1)
target

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 714, dtype: int64

In [69]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.2)

In [70]:
from sklearn import tree

In [71]:
model = tree.DecisionTreeClassifier()

In [72]:
model.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [73]:
model.score(X_train, y_train)

0.9859894921190894

#### Try replacing nan values and check

In [111]:
input = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1)
input.head(5)

   Survived  Pclass     Sex Age     Fare
0         0       3    male  22   7.2500
1         1       1  female  38  71.2833
2         1       3  female  26   7.9250
3         1       1  female  35  53.1000
4         0       3    male  35   8.0500

In [115]:
input.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [116]:
input.dtypes

Survived      int64
Pclass        int64
Sex          object
Age          object
Fare        float64
dtype: object

In [102]:
input['Sex_new'] = le_sex.fit_transform(input['Sex'])
input.head(5)

   Survived  Pclass     Sex Age     Fare  Sex_new
0         0       3    male  22   7.2500        1
1         1       1  female  38  71.2833        0
2         1       3  female  26   7.9250        0
3         1       1  female  35  53.1000        0
4         0       3    male  35   8.0500        1

In [103]:
target = input['Survived']
input = input.drop(['Sex','Survived'], axis=1)
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [104]:
input

,Pclass,Age,Fare,Sex_new
0,3,22,7.2500,1
1,1,38,71.2833,0
2,3,26,7.9250,0
3,1,35,53.1000,0
4,3,35,8.0500,1
...,...,...,...,...
886,2,27,13.0000,1
887,1,19,30.0000,0
888,3,<bound method Series.mean of 0 22.0\n1 ...,23.4500,0
889,1,26,30.0000,1
890,3,32,7.7500,1

In [93]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.2)

In [94]:
from sklearn import tree

In [95]:
model = tree.DecisionTreeClassifier()

In [96]:
model.fit(X_train, y_train)

ValueError: Input contains NaN, infinity or a value too large for dtype('float32').